FaiyuetCik/Display-Gadgets/code/example/147_ESP32/0703_DashBoard_147_ESP32/0703_DashBoard_147_ESP32.ino
/*
  XIAO ESP32-S3 Plus + 1.47 Touch Display
  Factory Dashboard v7.14 - D16 live sense + SD scheduler

  Based on:
    - 0519_DashBoard_147_ESP32.ino
    - 0522_DashBoard_147_nRF52840.ino

  Goals:
    - Keep the nRF52840 Plus 1.47 Dashboard visual style and card layout.
    - Keep ESP32-S3 peripherals from the previous 0519 bring-up:
        LCD, Touch, SD probe, IMU, PDM mic, USR1/USR2.
    - Add ESP32-S3 battery measurement:
        VBAT -- 316K -- ADC node -- 160K -- GND
        ratio = (316K + 160K) / 160K = 2.975
    - Product title differs only by board name:
        XIAO ESP32-S3 Plus

  Notes:
    - This is the non-camera dashboard build.
    - 1.47 LCD keeps the proven ST7789-compatible JD9853A path:
        IPS=false, 172x320, offset 34/0/34/0, MADCTL 0x48.
*/

#include <Arduino.h>
#include <Wire.h>
#include <SPI.h>
#include <SD.h>
#include <WiFi.h>
#include <Arduino_GFX_Library.h>
#include "esp_idf_version.h"

#if ESP_IDF_VERSION_MAJOR >= 5
  #include <driver/i2s_pdm.h>
#else
  #include <driver/i2s.h>
#endif

#include <driver/gpio.h>
#include <math.h>
#include <stdarg.h>
#include <esp_log.h>
#include "esp_lcd_touch_axs5106l.h"

// ========================= Build switches =========================

#define USE_PRD_PINMAP 1
#define LCD_USE_ESP32SPI 0
#define REDUCE_PDM_CLK_DRIVE 1

// Critical for the live dynamic dashboard:
// SD and LCD share D8/D10. SD.begin()/SD.open() can reconfigure or hold those pins.
// In v4.5, SD is probed once, then SD.end() is called immediately.
// No automatic SD file write is done at boot.
#define SD_PROBE_ONLY_MODE 1
#define SD_BUTTON_WRITE_TEST 0
#define g_sdBusy g_sdProbeBusy

// ========================= Timing =========================

static constexpr uint32_t UI_TEXT_FAST_MS   = 130;
static constexpr uint32_t UI_TEXT_SLOW_MS   = 220;
static constexpr uint32_t UI_VU_MS          = 75;
static constexpr uint32_t UI_MIC_TEXT_MS    = 360;
static constexpr uint32_t SERIAL_MS         = 1000;
static constexpr uint32_t SD_REFRESH_MS     = 1200;   // automatic SD quick-probe interval
static constexpr uint32_t SD_FULL_RETRY_COOLDOWN_MS = 6000;  // avoid repeated full SD.begin() on false positives
static constexpr uint32_t SD_LCD_IDLE_GAP_MS = 10;   // start SD probe only after LCD has been idle briefly
static constexpr uint32_t BAT_REFRESH_MS    = 250;
static constexpr uint32_t VSENSE_UI_MS      = 500;    // D16 live display check interval
static constexpr float    VSENSE_D16_DELTA_V  = 0.005f; // live D16 redraw threshold
static constexpr float    VSENSE_CALC_DELTA_V = 0.015f; // live calculated voltage redraw threshold
static constexpr uint32_t TAP_DEBOUNCE_MS   = 220;
static constexpr uint32_t MIC_DECAY_MS      = 60;
static constexpr uint32_t FOOTER_MS         = 500;

static constexpr uint32_t BTN_DEBOUNCE_MS = 18;
static constexpr uint32_t BTN_ACTION_LOCKOUT_MS = 70;

static const uint8_t BL_LEVELS[] = {255, 191, 128, 64, 0};
static constexpr uint8_t BL_LEVEL_COUNT = sizeof(BL_LEVELS) / sizeof(BL_LEVELS[0]);

// ========================= MIC config =========================

static constexpr int MIC_SAMPLE_RATE_HZ = 16000;
static constexpr bool MIC_CLK_INVERT = false;

// This is only display scaling, not recording gain.
static constexpr float MIC_DISPLAY_SCALE = 2200.0f;
static constexpr size_t MIC_SAMPLES_PER_READ = 256;

// ========================= Battery config =========================
//
// New ESP32-S3 hardware:
//   VBAT -- 316K -- ADC node -- 160K -- GND
// ratio = 476K / 160K = 2.975
//
// BAT_ADC_PIN is D16 from the 0519 ESP32-S3 Dashboard pin map.
// v7.3 policy:
//   BAT monitor only answers two questions:
//     1) Is a battery connected?
//     2) If connected, what is its approximate percentage?
//   No charging state is inferred or displayed.
// Because there is no CHG/STAT/VBUS/BAT_PRESENT pin, USB-only floating voltage
// cannot be perfectly distinguished from a real battery in every boot condition.
// This state machine is designed to be conservative for hotplug cases:
//   - reject impossible high jumps after a known real battery
//   - show USB PWR after battery removal under USB
//   - prevent USB insertion from making percentage jump instantly

static constexpr float BAT_R_TOP_KOHM        = 316.0f;
static constexpr float BAT_R_BOTTOM_KOHM     = 160.0f;
static constexpr float BAT_DIVIDER_RATIO     = (BAT_R_TOP_KOHM + BAT_R_BOTTOM_KOHM) / BAT_R_BOTTOM_KOHM;
static constexpr float BAT_CAL_FACTOR        = 1.000f;
static constexpr float BAT_VALID_MIN_V       = 2.80f;
static constexpr float BAT_VALID_MAX_V       = 4.60f;
static constexpr uint16_t BAT_PRESENT_MIN_MV = 850;  // ADC node mV, about 2.53V BAT after divider.
static constexpr uint16_t BAT_FLOAT_RANGE_MV = 90;   // large spread usually means floating/no battery.
static constexpr uint8_t BAT_VALID_CONFIRM_COUNT = 3;
static constexpr uint8_t BAT_INVALID_CONFIRM_COUNT = 3;

// Reject impossible high jump:
// Example: real battery 17% -> remove cell while USB is present -> ADC reports ~70%.
// That is not a real battery SoC jump, so classify it as USB/FLOAT.
static constexpr float BAT_IMPOSSIBLE_JUMP_V     = 0.28f;
static constexpr int   BAT_IMPOSSIBLE_JUMP_PCT   = 22;
static constexpr uint8_t BAT_FLOAT_REJECT_STREAK = 2;

// Reinsert unlock:
// After high-float rejection, accept battery again when measured voltage drops
// close to the last real battery voltage.
static constexpr float BAT_REINSERT_DROP_V       = 0.16f;

// Display percentage limiter.
// USB insertion may raise surface voltage. UI percentage must not jump upward.
// Falling percentage is immediate; rising percentage is slow.
static constexpr uint32_t BAT_PCT_RISE_INTERVAL_MS = 90000; // max +1% per 90s

// USB-only cold boot guard:
// With only BAT_ADC and no VBUS/STAT/BAT_PRESENT pin, USB-only floating voltage
// can look like a valid ~70% battery at boot. There is no perfect software-only
// truth source here. This guard is intentionally conservative for your observed
// case: if no real battery has ever been confirmed in this boot, a stable high
// reading above this percentage is treated as USB_PWR rather than BAT.
//
// Trade-off: a truly high-SOC battery-only cold boot may be classified as USB_PWR.
// If that use case matters more, set BAT_COLD_BOOT_HIGH_AS_USB to false or raise
// BAT_COLD_BOOT_SUSPECT_PCT.
static constexpr bool BAT_COLD_BOOT_HIGH_AS_USB = true;
static constexpr int  BAT_COLD_BOOT_SUSPECT_PCT = 60;

// USB-first then battery-insert compensation:
// Observed case:
//   1) USB-only boot -> USB PWR
//   2) insert battery while USB is still present -> displayed SoC jumps 27% -> 39%
//   3) unplug USB -> display drops back to 27%
// That means BAT ADC is seeing charger/surface voltage, not open-circuit battery voltage.
// Without VBUS/CHG/BAT_PRESENT pin, the best practical fix is to detect this path and
// subtract a conservative surface-voltage offset while USB compensation is active.
static constexpr float BAT_USB_INSERT_SURFACE_COMP_V = 0.085f; // about 8~12 percentage points around 30%.
static constexpr float BAT_USB_INSERT_RELEASE_DROP_V = 0.045f; // raw drop means USB removed or surface settled.
static constexpr float BAT_EFFECTIVE_MIN_V           = 3.25f;
// ========================= Pins =========================


static constexpr uint8_t MIC_CLK_PIN   = D0;
static constexpr uint8_t MIC_DATA_PIN  = D1;
static constexpr uint8_t LCD_CS_PIN    = D2;
static constexpr uint8_t LCD_DC_PIN    = D3;
static constexpr uint8_t I2C_SDA_PIN   = D4;
static constexpr uint8_t I2C_SCL_PIN   = D5;
static constexpr uint8_t SD_CS_PIN     = D6;
static constexpr uint8_t TOUCH_INT_PIN = D7;
static constexpr uint8_t LCD_SCK_PIN   = D8;
static constexpr uint8_t SD_MISO_PIN   = D9;
static constexpr uint8_t LCD_MOSI_PIN  = D10;
static constexpr uint8_t IMU_INT_PIN   = D14;
static constexpr uint8_t BTN_B_PIN     = D15;
static constexpr uint8_t BAT_ADC_PIN   = D16;

#if USE_PRD_PINMAP
static constexpr uint8_t LCD_RST_PIN   = D17;
static constexpr uint8_t BTN_A_PIN     = D19;
#else
static constexpr uint8_t LCD_RST_PIN   = D19;
static constexpr uint8_t BTN_A_PIN     = D17;
#endif

