FaiyuetCik/Display-Gadgets/code/example/147_ESP32/0703_DashBoard_147_ESP32/0703_DashBoard_147_ESP32.ino
static constexpr uint8_t LCD_BL_PIN    = D18;

// ========================= Colors =========================

static constexpr uint16_t C_BLACK   = RGB565_BLACK;
static constexpr uint16_t C_WHITE   = RGB565_WHITE;
static constexpr uint16_t C_GREEN   = RGB565_LIGHTGREEN;
static constexpr uint16_t C_RED     = RGB565_RED;
static constexpr uint16_t C_CYAN    = RGB565_CYAN;
static constexpr uint16_t C_YELLOW  = RGB565_YELLOW;
static constexpr uint16_t C_GRAY    = 0x8410;
static constexpr uint16_t C_ORANGE  = 0xFD20;
static constexpr uint16_t C_DIM     = 0x2104;
static constexpr uint16_t C_PANEL   = 0x0841;
static constexpr uint16_t C_LINE    = 0x39E7;
static constexpr uint16_t C_ACCENT  = 0x04FF;
static constexpr uint16_t C_PANEL_2 = 0x1082;
static constexpr uint16_t C_BLUE    = RGB565_BLUE;

// ========================= LCD object =========================

#if LCD_USE_ESP32SPI
Arduino_DataBus *lcdBus = new Arduino_ESP32SPI(
  LCD_DC_PIN, LCD_CS_PIN, LCD_SCK_PIN, LCD_MOSI_PIN
);
#else
Arduino_DataBus *lcdBus = new Arduino_SWSPI(
  LCD_DC_PIN, LCD_CS_PIN, LCD_SCK_PIN, LCD_MOSI_PIN, GFX_NOT_DEFINED
);
#endif

Arduino_GFX *gfx = new Arduino_ST7789(
  lcdBus, LCD_RST_PIN, 0, false, 172, 320, 34, 0, 34, 0
);

// ========================= I2S object =========================

#if ESP_IDF_VERSION_MAJOR >= 5
static i2s_chan_handle_t g_i2sRxChan = nullptr;
#else
static constexpr i2s_port_t I2S_PORT = I2S_NUM_0;
#endif

// ========================= State / UI layout =========================

bool g_lcdOk = false;

bool g_sdMounted = false;
bool g_sdSessionOpen = false;
uint32_t g_sdOkFreq = 0;
uint64_t g_sdCardSizeMB = 0;
bool g_sdProbeDone = false;

volatile bool g_sdProbeBusy = false;
volatile bool g_sdProbeRequest = false;
volatile bool g_sdProbeResultReady = false;
volatile bool g_sdProbePresentResult = false;
volatile uint32_t g_sdProbeFreqResult = 0;
volatile uint32_t g_sdProbeSizeMbResult = 0;
volatile uint32_t g_lastLcdOpMs = 0;
uint32_t g_sdFullRetryHoldUntilMs = 0;
uint8_t g_sdInsertStable = 0;
uint8_t g_sdRemoveStable = 0;

enum ImuType { IMU_NONE = 0, IMU_QMI8658, IMU_LSM6DS3 };
ImuType g_imuType = IMU_NONE;
uint8_t g_imuAddr = 0;
bool g_imuOk = false;
float g_ax = 0, g_ay = 0, g_az = 0;
float g_gx = 0, g_gy = 0, g_gz = 0;

bool g_touchFound = false;
uint8_t g_touchAddr = 0;
bool g_touchValid = false;
int g_touchX = -1;
int g_touchY = -1;
int g_touchRawX = -1;
int g_touchRawY = -1;
int g_touchIntRaw = HIGH;
uint8_t g_touchRawBytes[8] = {0};
uint32_t g_touchLastSeenMs = 0;
int g_touchLastX = -1;
int g_touchLastY = -1;

bool g_btnA = false;
bool g_btnB = false;
int g_btnARaw = HIGH;
int g_btnBRaw = HIGH;

bool g_btnALastRawPressed = false;
bool g_btnBLastRawPressed = false;
uint32_t g_btnALastChangeMs = 0;
uint32_t g_btnBLastChangeMs = 0;
bool g_btnAPendingAction = false;
bool g_btnBPendingAction = false;
uint32_t g_btnALastQueueMs = 0;
uint32_t g_btnBLastQueueMs = 0;
uint32_t g_lastBtnActionMs = 0;

uint8_t g_blIndex = 0;
uint8_t g_blRestoreIndex = 0;

bool g_micOk = false;
uint16_t g_micPeak = 0;
uint32_t g_micRms = 0;
uint32_t g_micLastUpdateMs = 0;
int16_t g_pdmBuf[MIC_SAMPLES_PER_READ];

struct BatteryState {
  uint16_t raw = 0;
  uint16_t rawMin = 0;
  uint16_t rawMax = 0;
  uint16_t mv = 0;
  uint16_t mvMin = 0;
  uint16_t mvMax = 0;
  float vadc = 0.0f;
  float vbat = 0.0f;
  int percent = 0;
  bool charging = false;
  bool valid = false;
};

BatteryState g_bat;
BatteryState g_vsense;       // raw live D16 ADC measurement
BatteryState g_vsensePrev;   // previous live D16 measurement for diagnostics
BatteryState g_lastGoodBat;
bool g_haveLastGoodBat = false;
uint8_t g_batValidStreak = 0;
uint8_t g_batInvalidStreak = 0;
const char *g_batFilterState = "BOOT";

uint32_t g_lastFastUiMs = 0;
uint32_t g_lastSlowUiMs = 0;
uint32_t g_lastVuMs = 0;
uint32_t g_lastMicTextMs = 0;
uint32_t g_lastSerialMs = 0;
uint32_t g_lastSdMs = 0;
uint32_t g_lastBatMs = 0;
uint32_t g_lastVsenseUiMs = 0;
uint32_t g_lastFooterMs = 0;

String cache_sd = "";
String cache_touch = "";
String cache_bat = "";
String cache_d16_adc = "";
String cache_d16_calc = "";
float g_d16ShownVadc = -1.0f;
float g_d16ShownCalc = -1.0f;
int cache_chargeIcon = -1;
int cache_batIconState = -1;
String cache_acc = "";
String cache_gyr = "";
String cache_btn1 = "";
String cache_btn2 = "";
String cache_tap = "";
String cache_bl = "";
String cache_mic = "";
String cache_footer = "";
String cache_tick = "";

float g_vuSmooth = 0.0f;
int cache_vuSegments = -1;
uint32_t g_frameCounter = 0;

volatile bool g_imuIntFlag = false;
bool g_imuTapConfigured = false;
uint32_t g_doubleTapCount = 0;
uint32_t g_lastTapMs = 0;

int g_batDisplayPercent = -1;
uint32_t g_batLastPctRiseMs = 0;

bool g_batFloatReject = false;
uint8_t g_batFloatRejectStreak = 0;
uint8_t g_batReinsertStreak = 0;
float g_batLastRealV = 0.0f;
int g_batLastRealPercent = -1;
uint8_t g_batColdUsbSuspectStreak = 0;

bool g_batUsbOnlySeen = false;
bool g_batUsbInsertCompActive = false;
float g_batUsbInsertRawStartV = 0.0f;

// nRF52 visual layout
static constexpr int CARD_X = 7;
static constexpr int CARD_W = 158;

static constexpr int Y_TITLE = 8;
static constexpr int Y_SUB1  = 32;

static constexpr int Y_SYS  = 54;
static constexpr int H_SYS  = 66;

static constexpr int Y_MOTION = 125;
static constexpr int H_MOTION = 58;

static constexpr int Y_MIC  = 189;
static constexpr int H_MIC  = 62;

static constexpr int Y_BTN  = 258;
static constexpr int H_BTN  = 48;

static constexpr int Y_PRODUCT = 311;

static constexpr int ROW_SD     = Y_SYS + 23;
static constexpr int ROW_TOUCH  = Y_SYS + 38;
static constexpr int ROW_BAT    = Y_SYS + 53;

static constexpr int BAT_ICON_X = 62;
static constexpr int BAT_ICON_Y = ROW_BAT - 2;
static constexpr int BAT_ICON_W = 22;
static constexpr int BAT_ICON_H = 12;

static constexpr int CHG_ICON_X = 148;
static constexpr int CHG_ICON_Y = ROW_BAT - 2;
static constexpr int CHG_ICON_W = 12;
static constexpr int CHG_ICON_H = 14;

static constexpr int ROW_ACC    = Y_MOTION + 23;
static constexpr int ROW_GYR    = Y_MOTION + 39;
static constexpr int ROW_TAP_MOTION = Y_MOTION + 8;

static constexpr int ROW_MIC_RAW = Y_MIC + 42;

static constexpr int ROW_BTN1   = Y_BTN + 20;
static constexpr int ROW_BTN2   = Y_BTN + 20;
static constexpr int ROW_BL     = Y_BTN + 34;

static constexpr int VU_X = CARD_X + 16;
static constexpr int VU_Y = Y_MIC + 27;
static constexpr int VU_W = 124;
static constexpr int VU_H = 14;
static constexpr int VU_SEG_COUNT = 12;
static constexpr int VU_GAP = 2;
static constexpr int VU_SEG_W = (VU_W - 4 - (VU_SEG_COUNT - 1) * VU_GAP) / VU_SEG_COUNT;

// LCD/SD share the same physical SPI pins. The SD probe runs in a background task.
// These flags prevent the background task from touching the bus while a LCD draw is
// in progress, and prevent UI cache updates when a draw is skipped.
volatile bool g_lcdBusy = false;

// ========================= Logging =========================

static void logf(const char *fmt, ...) {
  char buf[256];
  va_list args;
  va_start(args, fmt);
  vsnprintf(buf, sizeof(buf), fmt, args);
  va_end(args);
  Serial.print(buf);
}

// ========================= Helpers =========================

static String padRight(const String &s, int width) {
  String out = s;
  while ((int)out.length() < width) out += ' ';
  if ((int)out.length() > width) out = out.substring(0, width);
  return out;
}

