FaiyuetCik/Display-Gadgets/code/example/147_ESP32/0703_DashBoard_147_ESP32/0703_DashBoard_147_ESP32.ino
  lcdWriteMadctlFix();

  acquireForLcd();
  gfx->fillScreen(C_BLACK);

  g_lcdOk = true;
  Serial.println("[LCD] OK");
  return true;
}

static bool printTextFixed(int x, int y, uint16_t color, const String &text, int widthChars) {
  if (!beginLcdOp()) return false;
  gfx->setCursor(x, y);
  gfx->setTextSize(1);
  gfx->setTextColor(color, C_BLACK);
  gfx->print(padRight(text, widthChars));
  endLcdOp();
  return true;
}

static void drawVuFrame() {
  if (!beginLcdOp()) return;
  gfx->drawRoundRect(VU_X, VU_Y, VU_W, VU_H, 3, C_GREEN);
  for (int i = 0; i < VU_SEG_COUNT; ++i) {
    int x = VU_X + 2 + i * (VU_SEG_W + VU_GAP);
    gfx->fillRect(x, VU_Y + 2, VU_SEG_W, VU_H - 4, C_BLACK);
  }
  endLcdOp();
}

static void drawCard(int x, int y, int w, int h, uint16_t accent, const char *title) {
  if (!beginLcdOp()) return;
  gfx->drawRoundRect(x, y, w, h, 6, accent);
  gfx->drawRoundRect(x + 1, y + 1, w - 2, h - 2, 6, C_LINE);
  gfx->fillRect(x + 5, y + 12, 4, h - 24, accent);
  gfx->setTextSize(1);
  gfx->setTextColor(accent, C_BLACK);
  gfx->setCursor(x + 14, y + 8);
  gfx->print(title);
  endLcdOp();
}

static bool drawChargeIcon(bool charging) {
  if (!beginLcdOp()) return false;

  gfx->fillRect(CHG_ICON_X, CHG_ICON_Y, CHG_ICON_W, CHG_ICON_H, C_BLACK);

  if (charging) {
    const int x = CHG_ICON_X;
    const int y = CHG_ICON_Y;

    gfx->fillTriangle(x + 6, y + 0,  x + 1, y + 7,  x + 6, y + 7,  C_YELLOW);
    gfx->fillTriangle(x + 5, y + 6,  x + 11, y + 6, x + 4, y + 13, C_YELLOW);

    gfx->drawLine(x + 6, y + 0, x + 1, y + 7, C_ORANGE);
    gfx->drawLine(x + 1, y + 7, x + 6, y + 7, C_ORANGE);
    gfx->drawLine(x + 11, y + 6, x + 4, y + 13, C_ORANGE);
  }

  endLcdOp();
  return true;
}

static bool drawBatteryIcon(bool valid, int percent, bool charging) {
  if (!beginLcdOp()) return false;

  const int x = BAT_ICON_X;
  const int y = BAT_ICON_Y;

  gfx->fillRect(x - 1, y - 1, BAT_ICON_W + 5, BAT_ICON_H + 2, C_BLACK);

  uint16_t outline = valid ? C_WHITE : C_GRAY;
  uint16_t fillColor = valid ? colorByPercent(percent) : C_RED;
  gfx->drawRoundRect(x, y, BAT_ICON_W, BAT_ICON_H, 2, outline);
  gfx->fillRect(x + BAT_ICON_W, y + 4, 3, 4, outline);

  if (!valid) {
    gfx->drawLine(x + 4, y + 3, x + BAT_ICON_W - 4, y + BAT_ICON_H - 4, C_RED);
    gfx->drawLine(x + BAT_ICON_W - 4, y + 3, x + 4, y + BAT_ICON_H - 4, C_RED);
    endLcdOp();
    return true;
  }

  int fillW = map(percent, 0, 100, 0, BAT_ICON_W - 4);
  if (fillW < 0) fillW = 0;
  if (fillW > BAT_ICON_W - 4) fillW = BAT_ICON_W - 4;

  if (fillW > 0) {
    gfx->fillRect(x + 2, y + 2, fillW, BAT_ICON_H - 4, fillColor);
  }

  endLcdOp();
  return true;
}

static void drawStaticLayout() {
  if (!beginLcdOp()) return;
  gfx->fillScreen(C_BLACK);

  gfx->setCursor(8, Y_TITLE);
  gfx->setTextSize(2);
  gfx->setTextColor(C_GREEN, C_BLACK);
  gfx->println("Hello,XIAO!");

  gfx->setTextSize(1);
  gfx->setTextColor(C_CYAN, C_BLACK);
  gfx->setCursor(10, Y_SUB1);
  gfx->print("1.47 Inch Touch Display");

  gfx->drawFastHLine(8, 49, 156, C_LINE);
  endLcdOp();

  drawCard(CARD_X, Y_SYS, CARD_W, H_SYS, C_CYAN, "SYSTEM");
  if (beginLcdOp()) {
    gfx->setTextColor(C_WHITE, C_BLACK);
    gfx->setCursor(20, ROW_SD);    gfx->print("SD");
    gfx->setCursor(20, ROW_TOUCH); gfx->print("Touch");
    gfx->setCursor(20, ROW_BAT);   gfx->print("D16");
    gfx->setCursor(82, ROW_BAT);   gfx->print("Calc");
    endLcdOp();
  }

  drawCard(CARD_X, Y_MOTION, CARD_W, H_MOTION, C_YELLOW, "MOTION");
  if (beginLcdOp()) {
    gfx->setTextColor(C_YELLOW, C_BLACK);
    gfx->setCursor(110, ROW_TAP_MOTION); gfx->print("Tap 0");
    gfx->setTextColor(C_WHITE, C_BLACK);
    gfx->setCursor(20, ROW_ACC); gfx->print("Acc");
    gfx->setCursor(20, ROW_GYR); gfx->print("Gyr");
    endLcdOp();
  }

  drawCard(CARD_X, Y_MIC, CARD_W, H_MIC, C_GREEN, "MIC LEVEL");
  drawVuFrame();

  drawCard(CARD_X, Y_BTN, CARD_W, H_BTN, C_BLUE, "BACKLIGHT / BUTTON");
  if (beginLcdOp()) {
    gfx->setTextColor(C_WHITE, C_BLACK);
    gfx->setCursor(20, ROW_BTN1); gfx->print("Brightness");
    gfx->setTextColor(C_CYAN, C_BLACK);
    gfx->setCursor(20, ROW_BL); gfx->print("USR1 level  USR2 off");

    gfx->setTextSize(1);
    gfx->setTextColor(C_YELLOW, C_BLACK);
    gfx->setCursor(30, Y_PRODUCT);
    gfx->print("XIAO ESP32-S3 Plus");
    endLcdOp();
  }

  cache_sd = "";
  cache_touch = "";
  cache_bat = "";
  cache_d16_adc = "";
  cache_d16_calc = "";
  g_d16ShownVadc = -1.0f;
  g_d16ShownCalc = -1.0f;
  cache_chargeIcon = -1;
  cache_batIconState = -1;
  cache_acc = "";
  cache_gyr = "";
  cache_btn1 = "";
  cache_btn2 = "";
  cache_tap = "";
  cache_bl = "";
  cache_mic = "";
  cache_footer = "";
  cache_tick = "";
  cache_vuSegments = -1;
}

// ========================= SD =========================

static void closeSdSessionAndRestoreLcd() {
  SD.end();
  SPI.end();

  pinMode(SD_CS_PIN, OUTPUT);
  digitalWrite(SD_CS_PIN, HIGH);
  pinMode(SD_MISO_PIN, INPUT_PULLUP);
  restoreLcdSwSpiPins();
}

static uint8_t sdReadR1(uint8_t maxTries) {
  for (uint8_t i = 0; i < maxTries; i++) {
    uint8_t r = SPI.transfer(0xFF);
    if ((r & 0x80) == 0) return r;
  }
  return 0xFF;
}

static uint8_t sdSendCmd(uint8_t cmd, uint32_t arg, uint8_t crc) {
  SPI.transfer(0x40 | cmd);
  SPI.transfer((arg >> 24) & 0xFF);
  SPI.transfer((arg >> 16) & 0xFF);
  SPI.transfer((arg >> 8) & 0xFF);
  SPI.transfer(arg & 0xFF);
  SPI.transfer(crc);
  return sdReadR1(8);
}

static void waitForLcdIdleBeforeSd(uint32_t idleMs, uint32_t timeoutMs) {
  uint32_t start = millis();
  while (g_lcdBusy || (millis() - g_lastLcdOpMs) < idleMs) {
    if (millis() - start >= timeoutMs) break;
    vTaskDelay(pdMS_TO_TICKS(1));
  }
}

static bool sdQuickPresenceProbe() {
  // Raw SPI probe: only checks whether a card answers CMD0 with a valid idle R1.
  // No card should read as 0xFF because SD_MISO is pulled up. Treat anything other
  // than 0x01 as no-card to avoid falling into expensive SD.begin() timeouts.
  waitForLcdIdleBeforeSd(SD_LCD_IDLE_GAP_MS, 30);

