FaiyuetCik/Display-Gadgets/code/example/147_ESP32/0703_DashBoard_147_ESP32/0703_DashBoard_147_ESP32.ino
  acquireForSd();
  SPI.begin(LCD_SCK_PIN, SD_MISO_PIN, LCD_MOSI_PIN, SD_CS_PIN);
  SPI.beginTransaction(SPISettings(400000, MSBFIRST, SPI_MODE0));

  digitalWrite(SD_CS_PIN, HIGH);
  for (int i = 0; i < 10; i++) SPI.transfer(0xFF);  // 80 clocks

  digitalWrite(SD_CS_PIN, LOW);
  uint8_t r = sdSendCmd(0, 0, 0x95);  // CMD0: GO_IDLE_STATE
  digitalWrite(SD_CS_PIN, HIGH);
  SPI.transfer(0xFF);

  SPI.endTransaction();
  closeSdSessionAndRestoreLcd();

  return (r == 0x01);
}

static bool sdFullMountProbe(uint32_t &okFreq, uint32_t &cardSizeMb) {
  okFreq = 0;
  cardSizeMb = 0;

  bool quickPresent = sdQuickPresenceProbe();
  if (!quickPresent) {
    return false;
  }

  // If the card is already shown as inserted, do not full-mount on every poll.
  // This keeps automatic removal detection responsive without repeating SD.begin().
  if (g_sdMounted) {
    okFreq = g_sdOkFreq ? g_sdOkFreq : 400000;
    cardSizeMb = g_sdCardSizeMB ? (uint32_t)g_sdCardSizeMB : 1;
    return true;
  }

  // If a previous full mount failed, do not retry immediately. False positives
  // from floating/noisy MISO would otherwise cause repeated long SD.begin() stalls.
  uint32_t now = millis();
  if (g_sdFullRetryHoldUntilMs != 0 && (int32_t)(now - g_sdFullRetryHoldUntilMs) < 0) {
    return false;
  }

  // Candidate card detected and not shown inserted yet: full mount only now.
  waitForLcdIdleBeforeSd(SD_LCD_IDLE_GAP_MS, 40);

  acquireForSd();
  SPI.begin(LCD_SCK_PIN, SD_MISO_PIN, LCD_MOSI_PIN, SD_CS_PIN);
  delay(1);

  const uint32_t freqs[] = {400000};
  for (uint8_t i = 0; i < sizeof(freqs) / sizeof(freqs[0]); i++) {
    if (SD.begin(SD_CS_PIN, SPI, freqs[i])) {
      okFreq = freqs[i];
      uint64_t mb = SD.cardSize() / (1024ULL * 1024ULL);
      if (mb == 0) mb = 1;
      if (mb > 0xFFFFFFFFUL) mb = 0xFFFFFFFFUL;
      cardSizeMb = (uint32_t)mb;

      g_sdFullRetryHoldUntilMs = 0;
      closeSdSessionAndRestoreLcd();
      return true;
    }

    SD.end();
    SPI.end();
    pinMode(SD_MISO_PIN, INPUT_PULLUP);
    restoreLcdSwSpiPins();
    delay(1);
  }

  g_sdFullRetryHoldUntilMs = millis() + SD_FULL_RETRY_COOLDOWN_MS;
  closeSdSessionAndRestoreLcd();
  return false;
}

static void sdProbeTask(void *param) {
  (void)param;

  for (;;) {
    if (g_sdProbeRequest && !g_sdProbeBusy) {
      g_sdProbeRequest = false;
      g_sdProbeBusy = true;

      uint32_t freq = 0;
      uint32_t sizeMb = 0;
      bool present = sdFullMountProbe(freq, sizeMb);

      g_sdProbePresentResult = present;
      g_sdProbeFreqResult = freq;
      g_sdProbeSizeMbResult = sizeMb;
      g_sdProbeResultReady = true;

      g_sdProbeBusy = false;
    }

    vTaskDelay(pdMS_TO_TICKS(20));
  }
}

static void startSdProbeTask() {
  static bool started = false;
  if (started) return;
  started = true;

  xTaskCreatePinnedToCore(
    sdProbeTask,
    "sd_probe",
    4096,
    nullptr,
    1,
    nullptr,
    0
  );
}

static void requestSdProbe() {
  if (g_sdProbeBusy || g_sdProbeRequest) return;
  g_sdProbeRequest = true;
}

static void consumeSdProbeResult() {
  if (!g_sdProbeResultReady) return;

  bool present = g_sdProbePresentResult;
  uint32_t freq = g_sdProbeFreqResult;
  uint32_t sizeMb = g_sdProbeSizeMbResult;

  g_sdProbeResultReady = false;

  // Debounce:
  // - insert requires two positive probes.
  // - removal requires one negative probe for quick unplug response.
  if (present) {
    if (g_sdInsertStable < 3) g_sdInsertStable++;
    g_sdRemoveStable = 0;
  } else {
    if (g_sdRemoveStable < 3) g_sdRemoveStable++;
    g_sdInsertStable = 0;
  }

  bool oldState = g_sdMounted;

  if (present && g_sdInsertStable >= 2) {
    g_sdMounted = true;
    g_sdOkFreq = freq;
    g_sdCardSizeMB = sizeMb ? sizeMb : 1;
  }

  if (!present && g_sdRemoveStable >= 1) {
    g_sdMounted = false;
    g_sdOkFreq = 0;
    g_sdCardSizeMB = 0;
  }

  if (oldState != g_sdMounted) {
    cache_sd = "";  // force LCD row update immediately
  }

  // Do not print every unchanged SD poll. USB Serial output also costs time, and
  // repeated no-card logs make the dashboard look less responsive.
  if (oldState != g_sdMounted) {
    Serial.printf("[SD] state changed present=%u shown=%u freq=%lu size=%lluMB busy=%u\n",
                  present ? 1 : 0,
                  g_sdMounted ? 1 : 0,
                  (unsigned long)g_sdOkFreq,
                  g_sdCardSizeMB,
                  g_sdProbeBusy ? 1 : 0);
  }
}

static void updateSdStatus() {
  consumeSdProbeResult();
  requestSdProbe();
}

static void writeSdTestFileOnce() {
  // Dashboard mode: USR2 only requests an immediate async probe.
  requestSdProbe();
  Serial.println("[SD] async status refresh requested");
}

// ========================= Touch =========================

static bool i2cDevicePresent(uint8_t addr) {
  Wire.beginTransmission(addr);
  return Wire.endTransmission() == 0;
}

static void initTouch() {
  pinMode(TOUCH_INT_PIN, INPUT_PULLUP);

  if (!i2cDevicePresent(AXS5106L_ADDR)) {
    g_touchFound = false;
    g_touchAddr = 0;
    Serial.println("[TOUCH] AXS5106L not found at 0x63");
    return;
  }

  // The Waveshare BSP library resets the touch controller with tp_rst and attaches
  // the falling-edge interrupt on tp_int.
  //
  // Important for our board:
  // D17 is currently shared/used as LCD_RST in our pin map. Calling this before
  // initLcd() is safe because LCD is initialized after the touch reset pulse.
  bsp_touch_init(&Wire, LCD_RST_PIN, TOUCH_INT_PIN, 0, 172, 320);

  g_touchFound = true;
  g_touchAddr = AXS5106L_ADDR;
  g_touchValid = false;
  g_touchX = -1;
  g_touchY = -1;

  Serial.println("[TOUCH] AXS5106L BSP driver OK at 0x63");
}

static void normalizeTouchToScreen(int rawX, int rawY) {
  g_touchRawX = rawX;
  g_touchRawY = rawY;

  int x = rawX;
  int y = rawY;

  // This product is portrait 172x320.
  // Some controllers report landscape 320x172, so swap in that case.
  if (rawX >= 0 && rawY >= 0 && rawX <= 320 && rawY <= 172 && rawX > 171) {
    x = rawY;
    y = rawX;
  }

  // Some controllers may report 12-bit ADC coordinates.
  if (x > 360 || y > 360) {
    x = map(rawX, 0, 4095, 0, 171);
    y = map(rawY, 0, 4095, 0, 319);
  }

  if (x < 0) x = 0;
  if (x > 171) x = 171;
  if (y < 0) y = 0;
  if (y > 319) y = 319;

  g_touchX = x;
  g_touchY = y;
}

static bool validTouchCandidate(int x, int y) {
  if (x < 0 || y < 0) return false;
  if (x > 4095 || y > 4095) return false;
  // Reject the most common empty patterns.
  if ((x == 0 && y == 0) || (x == 4095 && y == 4095)) return false;
  return true;
}

static bool decodeCandidateCstStyle(const uint8_t *b, int base, int &x, int &y) {
  uint8_t fingers = b[base + 1] & 0x0F;
  if (fingers == 0 || fingers > 5) return false;

  x = ((uint16_t)(b[base + 2] & 0x0F) << 8) | b[base + 3];
  y = ((uint16_t)(b[base + 4] & 0x0F) << 8) | b[base + 5];

