FaiyuetCik/Display-Gadgets/code/example/147_ESP32/0703_DashBoard_147_ESP32/0703_DashBoard_147_ESP32.ino
  return validTouchCandidate(x, y);
}

static bool decodeCandidateFtStyle(const uint8_t *b, int base, int &x, int &y) {
  uint8_t fingers = b[base] & 0x0F;
  if (fingers == 0 || fingers > 5) return false;

  x = ((uint16_t)(b[base + 1] & 0x0F) << 8) | b[base + 2];
  y = ((uint16_t)(b[base + 3] & 0x0F) << 8) | b[base + 4];

  return validTouchCandidate(x, y);
}

static bool decodeRawTouchPacket(const uint8_t *b, int &x, int &y) {
  // Raw 0x63 read is the only transaction we use for AXS5106L-like touch.
  // It avoids the repeated I2C NACK spam caused by invalid register reads.
  //
  // Try several compact 5/6-byte layouts. The correct one will be selected
  // by range validation and then normalized to 172x320.
  int candidates[6][2];

  candidates[0][0] = ((int)(b[1] & 0x0F) << 8) | b[2];
  candidates[0][1] = ((int)(b[3] & 0x0F) << 8) | b[4];

  candidates[1][0] = ((int)(b[2] & 0x0F) << 8) | b[3];
  candidates[1][1] = ((int)(b[4] & 0x0F) << 8) | b[5];

  candidates[2][0] = ((int)b[1] << 8) | b[2];
  candidates[2][1] = ((int)b[3] << 8) | b[4];

  candidates[3][0] = ((int)b[2] << 8) | b[3];
  candidates[3][1] = ((int)b[4] << 8) | b[5];

  candidates[4][0] = b[2];
  candidates[4][1] = b[4];

  candidates[5][0] = b[1];
  candidates[5][1] = b[3];

  for (int i = 0; i < 6; i++) {
    int cx = candidates[i][0];
    int cy = candidates[i][1];

    // Native portrait or landscape coordinate windows.
    bool directPortrait = (cx >= 0 && cx <= 171 && cy >= 0 && cy <= 319);
    bool landscape = (cx >= 0 && cx <= 319 && cy >= 0 && cy <= 171);
    bool adc12 = (cx >= 0 && cx <= 4095 && cy >= 0 && cy <= 4095 && (cx > 360 || cy > 360));

    if (directPortrait || landscape || adc12) {
      // Reject empty/release-looking packets.
      if ((cx == 0 && cy == 0) || (cx == 4095 && cy == 4095)) continue;
      x = cx;
      y = cy;
      return true;
    }
  }

  return false;
}

static bool readTouchAxs5106lLike(int &x, int &y) {
  uint8_t b[6] = {};

  // One short raw read only. No register write, no long reads.
  if (!i2cRawRead(0x63, b, sizeof(b))) {
    return false;
  }

  for (int i = 0; i < 6; i++) {
    g_touchRawBytes[i] = b[i];
  }

  // If INT exists and is high, many touch controllers are in release state.
  // Still decode raw bytes below, because some boards wire INT differently.
  if (!decodeRawTouchPacket(b, x, y)) {
    return false;
  }

  return true;
}

static void updateTouch() {
  g_touchValid = false;
  g_touchX = -1;
  g_touchY = -1;
  g_touchRawX = -1;
  g_touchRawY = -1;
  g_touchIntRaw = digitalRead(TOUCH_INT_PIN);

  for (int i = 0; i < 8; i++) {
    g_touchRawBytes[i] = 0;
  }

  if (!g_touchFound) {
    return;
  }

  // BSP path from esp_lcd_touch_axs5106l:
  // 1) bsp_touch_read() updates the library's internal g_touch_data only when INT fires.
  // 2) bsp_touch_get_coordinates() returns transformed coordinates.
  bsp_touch_read();

  touch_data_t data = {};
  if (bsp_touch_get_coordinates(&data)) {
    int rawX = data.coords[0].x;
    int rawY = data.coords[0].y;

    g_touchRawX = rawX;
    g_touchRawY = rawY;

    normalizeTouchToScreen(rawX, rawY);

    g_touchLastX = g_touchX;
    g_touchLastY = g_touchY;
    g_touchLastSeenMs = millis();

    g_touchValid = true;
    return;
  }

  // The BSP library is interrupt-driven. Some touch panels only fire INT on down/move,
  // so keep the latest coordinate visible briefly instead of flickering immediately
  // back to release.
  if (g_touchLastSeenMs != 0 && (millis() - g_touchLastSeenMs) < 350) {
    g_touchX = g_touchLastX;
    g_touchY = g_touchLastY;
    g_touchRawX = g_touchLastX;
    g_touchRawY = g_touchLastY;
    g_touchValid = true;
    return;
  }
}

// ========================= IMU =========================

static bool initQmi(uint8_t addr) {
  uint8_t who = 0;
  if (!i2cRead8(addr, 0x00, &who)) return false;
  if (who == 0x00 || who == 0xFF) return false;

  i2cWrite8(addr, 0x02, 0x60);
  i2cWrite8(addr, 0x03, 0x03);
  i2cWrite8(addr, 0x04, 0x53);
  i2cWrite8(addr, 0x08, 0x03);
  delay(20);

  uint8_t data[12] = {};
  if (!i2cRead(addr, 0x35, data, sizeof(data))) return false;

  g_imuType = IMU_QMI8658;
  g_imuAddr = addr;
  g_imuOk = true;
  Serial.printf("[IMU] QMI8658-compatible at 0x%02X, WHO=0x%02X\n", addr, who);
  return true;
}

static bool initLsm(uint8_t addr) {
  uint8_t who = 0;
  if (!i2cRead8(addr, 0x0F, &who)) return false;
  if (who != 0x69 && who != 0x6A && who != 0x6C) return false;

  i2cWrite8(addr, 0x10, 0x60);
  i2cWrite8(addr, 0x11, 0x60);
  delay(20);

  g_imuType = IMU_LSM6DS3;
  g_imuAddr = addr;
  g_imuOk = true;
  Serial.printf("[IMU] LSM6-compatible at 0x%02X, WHO=0x%02X\n", addr, who);
  return true;
}

// ========================= IMU double-tap interrupt =========================
//
// LSM6DS3/LSM6DSO-family double tap registers:
//   TAP_SRC       0x1C: read to clear tap event; bit4 is DOUBLE_TAP.
//   TAP_CFG       0x58: enable tap recognition on X/Y/Z and embedded interrupts.
//   TAP_THS_6D    0x59: tap threshold.
//   INT_DUR2      0x5A: shock/quiet/duration timing.
//   WAKE_UP_THS   0x5B: bit7 enables single/double-tap recognition.
//   MD1_CFG       0x5E: route double-tap event to INT1.
//
// If taps are hard to trigger, lower TAP_THS_6D from 0x0C to 0x08.
// If false triggers occur, raise it to 0x10.

static constexpr uint8_t LSM_REG_TAP_SRC     = 0x1C;
static constexpr uint8_t LSM_REG_CTRL1_XL    = 0x10;
static constexpr uint8_t LSM_REG_TAP_CFG     = 0x58;
static constexpr uint8_t LSM_REG_TAP_THS_6D  = 0x59;
static constexpr uint8_t LSM_REG_INT_DUR2    = 0x5A;
static constexpr uint8_t LSM_REG_WAKE_UP_THS = 0x5B;
static constexpr uint8_t LSM_REG_MD1_CFG     = 0x5E;

void IRAM_ATTR imuIntIsr() {
  g_imuIntFlag = true;
}

static bool initImuDoubleTap() {
  g_imuTapConfigured = false;

  if (g_imuType != IMU_LSM6DS3 || g_imuAddr == 0) {
    Serial.println("[IMU] double-tap INT skipped: non-LSM IMU");
    return false;
  }

  pinMode(IMU_INT_PIN, INPUT_PULLDOWN);

  bool ok = true;

  // Accelerometer on, 416Hz, +/-2g.
  // Tap detection needs a known accelerometer ODR.
  ok &= i2cWrite8(g_imuAddr, LSM_REG_CTRL1_XL, 0x60);

  // 0x8E: embedded interrupts enabled, tap recognition on X/Y/Z.
  ok &= i2cWrite8(g_imuAddr, LSM_REG_TAP_CFG, 0x8E);

