FaiyuetCik/Display-Gadgets/code/example/147_ESP32/0703_DashBoard_147_ESP32/0703_DashBoard_147_ESP32.ino
static void updateMicPeak() {
  if (!g_micOk) return;

  size_t bytesRead = 0;
  if (!readMic(&bytesRead, 2)) {
    return;
  }

  int samples = bytesRead / sizeof(int16_t);
  if (samples <= 0) return;

  int64_t sum = 0;
  for (int i = 0; i < samples; ++i) {
    sum += g_pdmBuf[i];
  }
  int32_t mean = (int32_t)(sum / samples);

  uint32_t peak = 0;
  uint64_t sq = 0;
  for (int i = 0; i < samples; ++i) {
    int32_t v = (int32_t)g_pdmBuf[i] - mean;
    uint32_t a = (v < 0) ? (uint32_t)(-v) : (uint32_t)v;
    if (a > peak) peak = a;
    sq += (uint64_t)a * (uint64_t)a;
  }

  g_micPeak = (uint16_t)((peak > 65535) ? 65535 : peak);
  g_micRms = (uint32_t)sqrt((double)sq / samples);
  g_micLastUpdateMs = millis();
}

static uint16_t currentMicPeak() {
  uint32_t now = millis();
  if (now - g_micLastUpdateMs > MIC_DECAY_MS) {
    g_micPeak = (uint16_t)(g_micPeak * 0.75f);
    g_micRms = (uint32_t)(g_micRms * 0.75f);
  }
  return g_micPeak;
}

static uint16_t vuColorForIndex(int idx) {
  if (idx >= 10) return C_RED;
  if (idx >= 7) return C_ORANGE;
  return C_GREEN;
}

// ========================= UI updates =========================

static void updateVuMeter() {
  uint16_t micPeak = currentMicPeak();

  float target = (float)micPeak / MIC_DISPLAY_SCALE;
  if (target < 0.0f) target = 0.0f;
  if (target > 1.0f) target = 1.0f;

  if (target > g_vuSmooth) g_vuSmooth = g_vuSmooth * 0.55f + target * 0.45f;
  else g_vuSmooth = g_vuSmooth * 0.86f + target * 0.14f;

  int activeSegs = (int)roundf(g_vuSmooth * VU_SEG_COUNT);
  if (activeSegs < 0) activeSegs = 0;
  if (activeSegs > VU_SEG_COUNT) activeSegs = VU_SEG_COUNT;

  if (activeSegs == cache_vuSegments) return;

  if (!beginLcdOp()) return;
  for (int i = 0; i < VU_SEG_COUNT; ++i) {
    int x = VU_X + 2 + i * (VU_SEG_W + VU_GAP);
    uint16_t color = (i < activeSegs) ? vuColorForIndex(i) : C_BLACK;
    gfx->fillRect(x, VU_Y + 2, VU_SEG_W, VU_H - 4, color);
  }
  endLcdOp();

  cache_vuSegments = activeSegs;
}

static void updateMicText() {
  uint16_t micPeak = currentMicPeak();
  String micText = String("Raw ") + String((unsigned)micPeak);
  if (micText != cache_mic) {
    if (printTextFixed(18, ROW_MIC_RAW, C_WHITE, micText, 18)) {
      cache_mic = micText;
    }
  }
}


// ========================= Battery =========================

static void initBatteryAdc() {
  analogReadResolution(12);
  analogSetPinAttenuation(BAT_ADC_PIN, ADC_11db);
}

static BatteryState readBatteryMeasured() {
  BatteryState b;
  uint32_t rawSum = 0;
  uint32_t mvSum = 0;
  uint16_t rawMin = 65535, rawMax = 0;
  uint16_t mvMin = 65535, mvMax = 0;

  // v7.14: D16 live sense mode.
  // Use a light sampler so plug/unplug/switch changes are visible quickly.
  // Keep analogReadMilliVolts() for calibrated voltage, but avoid the old 32-sample
  // battery-percent averaging path.
  for (int i = 0; i < 2; i++) {
    (void)analogRead(BAT_ADC_PIN);
    delayMicroseconds(80);
  }

  static constexpr int N = 8;
  for (int i = 0; i < N; i++) {
    uint16_t raw = analogRead(BAT_ADC_PIN);
    uint16_t mv = analogReadMilliVolts(BAT_ADC_PIN);

    rawSum += raw;
    mvSum += mv;

    if (raw < rawMin) rawMin = raw;
    if (raw > rawMax) rawMax = raw;
    if (mv < mvMin) mvMin = mv;
    if (mv > mvMax) mvMax = mv;

    delayMicroseconds(80);
  }

  b.raw = rawSum / N;
  b.rawMin = rawMin;
  b.rawMax = rawMax;
  b.mv = mvSum / N;
  b.mvMin = mvMin;
  b.mvMax = mvMax;
  b.vadc = (float)b.mv / 1000.0f;
  b.vbat = b.vadc * BAT_DIVIDER_RATIO * BAT_CAL_FACTOR;
  b.percent = lipoPercent(b.vbat);
  b.charging = false;
  b.valid = true;
  return b;
}

static int updatePresencePercent(int measuredPercent, bool freshBattery) {
  measuredPercent = constrain(measuredPercent, 0, 100);
  uint32_t now = millis();

  if (freshBattery || g_batDisplayPercent < 0) {
    g_batDisplayPercent = measuredPercent;
    g_batLastPctRiseMs = now;
    return g_batDisplayPercent;
  }

  // Falling percentage is allowed immediately.
  if (measuredPercent < g_batDisplayPercent) {
    g_batDisplayPercent = measuredPercent;
    return g_batDisplayPercent;
  }

  // Rising percentage is rate-limited. This prevents USB insertion / charger
  // surface voltage from making 17% become 25% or 70% instantly.
  if (measuredPercent > g_batDisplayPercent &&
      (now - g_batLastPctRiseMs >= BAT_PCT_RISE_INTERVAL_MS)) {
    g_batDisplayPercent++;
    g_batLastPctRiseMs = now;
  }

  return g_batDisplayPercent;
}

static bool isImpossibleHighJump(const BatteryState &m) {
  if (!g_haveLastGoodBat) return false;

  float dv = m.vbat - g_lastGoodBat.vbat;
  int dp = m.percent - g_lastGoodBat.percent;

  return (dv >= BAT_IMPOSSIBLE_JUMP_V) || (dp >= BAT_IMPOSSIBLE_JUMP_PCT);
}

static void markBatteryAbsentLikeUsb(const BatteryState &measured, const char *state) {
  g_batUsbOnlySeen = true;
  g_batUsbInsertCompActive = false;
  g_batUsbInsertRawStartV = 0.0f;

  g_bat = measured;
  g_bat.valid = false;
  g_bat.charging = false;
  g_bat.percent = 0;

  // Do not clear g_lastGoodBat here. We need last real battery memory to
  // identify re-insertion after USB/floating node.
  g_batFilterState = state;

  cache_bat = "";
  cache_chargeIcon = -1;
  cache_batIconState = -1;
}

static float batteryEffectiveVoltageForPercent(float rawV, bool freshBattery) {
  // Activate compensation only in the specific path:
  // this boot has already seen USB_PWR/USB_BOOT_HIGH, and then a battery becomes
  // plausible for the first time. Battery-only boot is untouched.
  if (freshBattery && g_batUsbOnlySeen && !g_batUsbInsertCompActive) {
    g_batUsbInsertCompActive = true;
    g_batUsbInsertRawStartV = rawV;
    Serial.print("[BAT] USB-first battery insert compensation ON rawStart=");
    Serial.println(g_batUsbInsertRawStartV, 3);
  }

  if (g_batUsbInsertCompActive) {
    // If the raw voltage falls by enough, USB was probably unplugged or the
    // charger surface voltage settled. Stop compensating; otherwise it would
    // under-report once the battery returns to its real voltage.
    if (g_batUsbInsertRawStartV > 0.0f &&
        rawV <= (g_batUsbInsertRawStartV - BAT_USB_INSERT_RELEASE_DROP_V)) {
      g_batUsbInsertCompActive = false;
      Serial.print("[BAT] USB-insert compensation OFF raw=");
      Serial.println(rawV, 3);
      return rawV;
    }

    float compensated = rawV - BAT_USB_INSERT_SURFACE_COMP_V;
    if (compensated < BAT_EFFECTIVE_MIN_V) compensated = BAT_EFFECTIVE_MIN_V;
    return compensated;
  }

  return rawV;
}

