FaiyuetCik/Display-Gadgets/code/example/147_ESP32/0703_DashBoard_147_ESP32/0703_DashBoard_147_ESP32.ino
static bool isColdBootUsbSuspect(const BatteryState &m, bool stable) {
  if (!BAT_COLD_BOOT_HIGH_AS_USB) return false;
  if (g_haveLastGoodBat) return false;
  if (!stable) return false;
  return (m.percent >= BAT_COLD_BOOT_SUSPECT_PCT);
}

static void updateBattery() {
  BatteryState measured = readBatteryMeasured();

  // v7.14: D16 voltage sense only.
  // Do not run the old BAT_PRESENT / USB_BOOT_HIGH / percentage state machine.
  // That state machine was for battery SoC display and can make testing confusing.
  g_vsensePrev = g_vsense;
  g_vsense = measured;
  g_bat = measured;

  uint16_t mvSpread = measured.mvMax - measured.mvMin;

  if (measured.mv < 50) {
    g_batFilterState = "LOW";
  } else if (mvSpread > BAT_FLOAT_RANGE_MV) {
    g_batFilterState = "NOISY";
  } else if (measured.vbat < BAT_VALID_MIN_V || measured.vbat > BAT_VALID_MAX_V) {
    g_batFilterState = "OUT_RANGE";
  } else {
    g_batFilterState = "LIVE";
  }
}

static String voltageFixedText(float v) {
  char buf[12];
  snprintf(buf, sizeof(buf), "%.2fV", v);
  return String(buf);
}

static void updateUiFast() {
  String sdText = g_sdMounted ? (String("OK ") + String(g_sdOkFreq / 1000) + "k") : "Unplugged";
  if (sdText != cache_sd) {
    if (printTextFixed(62, ROW_SD, g_sdMounted ? C_GREEN : C_RED, sdText, 15)) {
      cache_sd = sdText;
    }
  }

  String touchText = g_touchValid ? (String("(") + g_touchX + "," + g_touchY + ")") : String("release");
  if (!g_touchFound) touchText = "not found";
  if (touchText != cache_touch) {
    if (printTextFixed(62, ROW_TOUCH, g_touchFound ? C_CYAN : C_RED, touchText, 15)) {
      cache_touch = touchText;
    }
  }

  // D16 voltage row:
  // Labels are static. Numeric fields redraw only on meaningful voltage changes.
  // This avoids 0.01 V ADC jitter causing repeated software-SPI text redraws.
  if (millis() - g_lastVsenseUiMs >= VSENSE_UI_MS ||
      cache_d16_adc.length() == 0 || cache_d16_calc.length() == 0) {
    g_lastVsenseUiMs = millis();

    float d16Now = roundf(g_vsense.vadc * 100.0f) / 100.0f;
    float calcNow = roundf(g_vsense.vbat * 100.0f) / 100.0f;

    bool needD16 = (g_d16ShownVadc < 0.0f) || (fabsf(d16Now - g_d16ShownVadc) >= VSENSE_D16_DELTA_V);
    if (needD16) {
      String d16Text = voltageFixedText(d16Now);
      if (printTextFixed(46, ROW_BAT, C_YELLOW, d16Text, 6)) {
        cache_d16_adc = d16Text;
        g_d16ShownVadc = d16Now;
      }
    }

    bool needCalc = (g_d16ShownCalc < 0.0f) || (fabsf(calcNow - g_d16ShownCalc) >= VSENSE_CALC_DELTA_V);
    if (needCalc) {
      String calcText = voltageFixedText(calcNow);
      if (printTextFixed(116, ROW_BAT, C_YELLOW, calcText, 6)) {
        cache_d16_calc = calcText;
        g_d16ShownCalc = calcNow;
      }
    }
  }

  // No battery icon or charge icon: this row is voltage sense, not battery status.
  cache_batIconState = -1;
  cache_chargeIcon = 0;

  String blText = String(currentBacklightPercent()) + "%";
  if (blText != cache_bl) {
    uint16_t c = currentBacklightPwm() == 0 ? C_RED : C_CYAN;
    if (printTextFixed(118, ROW_BTN1, c, blText, 4)) {
      cache_bl = blText;
    }
  }

  String tapText = String("Tap ") + String(g_doubleTapCount);
  if (tapText != cache_tap) {
    if (printTextFixed(110, ROW_TAP_MOTION, C_YELLOW, tapText, 7)) {
      cache_tap = tapText;
    }
  }
}

static void updateUiSlow() {
  char buf[64];

  String accText;
  if (g_imuOk) {
    snprintf(buf, sizeof(buf), "%.1f %.1f %.1f", g_ax, g_ay, g_az);
    accText = String(buf);
  } else {
    accText = "not found";
  }

  if (accText != cache_acc) {
    if (printTextFixed(50, ROW_ACC, g_imuOk ? C_WHITE : C_RED, accText, 16)) {
      cache_acc = accText;
    }
  }

  String gyrText;
  if (g_imuOk) {
    snprintf(buf, sizeof(buf), "%.1f %.1f %.1f", g_gx, g_gy, g_gz);
    gyrText = String(buf);
  } else {
    gyrText = "not found";
  }

  if (gyrText != cache_gyr) {
    if (printTextFixed(50, ROW_GYR, g_imuOk ? C_WHITE : C_RED, gyrText, 16)) {
      cache_gyr = gyrText;
    }
  }
}

static void updateFooter() {
  // Footer is static in this nRF52-parity UI.
}

static void printSerialStatus() {
  Serial.print("[DASH_S3] sd=");
  Serial.print(g_sdMounted ? "Inserted" : "Unplugged");
  Serial.print(" freq=");
  Serial.print((unsigned long)g_sdOkFreq);

  Serial.print(" touch=");
  Serial.print(g_touchValid ? "Y" : "N");
  Serial.print(" x=");
  Serial.print(g_touchX);
  Serial.print(" y=");
  Serial.print(g_touchY);

  Serial.print(" d16_adc=");
  Serial.print(g_vsense.vadc, 3);
  Serial.print("V calc=");
  Serial.print(g_vsense.vbat, 3);
  Serial.print("V raw=");
  Serial.print(g_vsense.raw);
  Serial.print(" rawMin=");
  Serial.print(g_vsense.rawMin);
  Serial.print(" rawMax=");
  Serial.print(g_vsense.rawMax);
  Serial.print(" mv=");
  Serial.print(g_vsense.mv);
  Serial.print(" spread=");
  Serial.print((unsigned)(g_vsense.mvMax - g_vsense.mvMin));
  Serial.print(" dCalc=");
  Serial.print(g_vsense.vbat - g_vsensePrev.vbat, 3);
  Serial.print("V vstate=");
  Serial.print(g_batFilterState);

  Serial.print(" imu=");
  Serial.print(g_imuOk ? "OK" : "NO");
  Serial.print(" tapCfg=");
  Serial.print(g_imuTapConfigured ? "Y" : "N");
  Serial.print(" tap=");
  Serial.print((unsigned long)g_doubleTapCount);
  Serial.print(" type=");
  Serial.print((int)g_imuType);
  Serial.print(" acc=(");
  Serial.print(g_ax, 2);
  Serial.print(",");
  Serial.print(g_ay, 2);
  Serial.print(",");
  Serial.print(g_az, 2);
  Serial.print(") gyr=(");
  Serial.print(g_gx, 2);
  Serial.print(",");
  Serial.print(g_gy, 2);
  Serial.print(",");
  Serial.print(g_gz, 2);
  Serial.print(")");

  Serial.print(" micPeak=");
  Serial.print((unsigned)currentMicPeak());
  Serial.print(" micRms=");
  Serial.print((unsigned long)g_micRms);

  Serial.print(" usr1=");
  Serial.print(g_btnA ? "Pressed" : "Released");
  Serial.print(" raw1=");
  Serial.print(g_btnARaw);
  Serial.print(" usr2=");
  Serial.print(g_btnB ? "Pressed" : "Released");
  Serial.print(" raw2=");
  Serial.print(g_btnBRaw);

  Serial.print(" bl=");
  Serial.print((unsigned)currentBacklightPwm());
  Serial.print("/");
  Serial.print(currentBacklightPercent());
  Serial.print("%");

  Serial.print(" tick=");
  Serial.println((unsigned long)g_frameCounter);
}

