FaiyuetCik/Display-Gadgets/code/example/147_ESP32/0703_DashBoard_147_ESP32/0703_DashBoard_147_ESP32.ino
// ========================= Setup / loop =========================

static void printHeader() {
  Serial.println();
  Serial.println("=== XIAO ESP32-S3 Plus 1.47 Factory Dashboard v7.14 D16-live-sense ===");
  Serial.println("nRF52 visual parity + ESP32-S3 D16 live voltage sense display");
  Serial.printf("LCD: %s, CS=D2(%d), DC=D3(%d), SCK=D8(%d), MOSI=D10(%d), RST=%s(%d), BL=D18(%d)\n",
                LCD_USE_ESP32SPI ? "ESP32SPI" : "SWSPI",
                LCD_CS_PIN, LCD_DC_PIN, LCD_SCK_PIN, LCD_MOSI_PIN,
                USE_PRD_PINMAP ? "D17" : "D19", LCD_RST_PIN, LCD_BL_PIN);
  Serial.printf("MIC: CLK=D0(%d), DATA=D1(%d), sample=%d\n", MIC_CLK_PIN, MIC_DATA_PIN, MIC_SAMPLE_RATE_HZ);
  Serial.printf("SD : CS=D6(%d), SCK=D8(%d), MISO=D9(%d), MOSI=D10(%d)\n", SD_CS_PIN, LCD_SCK_PIN, SD_MISO_PIN, LCD_MOSI_PIN);
  Serial.printf("I2C: SDA=D4(%d), SCL=D5(%d), TOUCH_INT=D7(%d), IMU_INT=D14(%d)\n", I2C_SDA_PIN, I2C_SCL_PIN, TOUCH_INT_PIN, IMU_INT_PIN);
  Serial.printf("BTN: USR1=%d, USR2=%d\n", BTN_A_PIN, BTN_B_PIN);
  Serial.printf("D16: ADC=D16(%d), divider=316K/160K, calc ratio=%.3f, live-sense mode\n", BAT_ADC_PIN, BAT_DIVIDER_RATIO);
  Serial.println("TOUCH: Waveshare esp_lcd_touch_axs5106l BSP API");
  Serial.println("SD: async full-mount probe task with LCD bus guard");
}

void setup() {
  Serial.begin(115200);
  delay(1000);

  // Avoid flooding serial with ESP-IDF I2C NACK diagnostics while probing touch.
  // We still report touch status in our own [DASH] line.
  esp_log_level_set("i2c.master", ESP_LOG_NONE);

  WiFi.mode(WIFI_OFF);
  WiFi.disconnect(true);

  printHeader();

  pinMode(BTN_A_PIN, INPUT_PULLUP);
  pinMode(BTN_B_PIN, INPUT_PULLUP);
  pinMode(SD_CS_PIN, OUTPUT);
  pinMode(LCD_CS_PIN, OUTPUT);
  pinMode(SD_MISO_PIN, INPUT_PULLUP);
  digitalWrite(SD_CS_PIN, HIGH);
  digitalWrite(LCD_CS_PIN, HIGH);

  initBatteryAdc();

  Wire.begin(I2C_SDA_PIN, I2C_SCL_PIN);
  Wire.setClock(400000);

  scanI2c();

  initTouch();
  initImu();

  if (!initLcd()) {
    Serial.println("[FAIL] LCD init failed");
    return;
  }

  drawStaticLayout();

  if (!initMic()) {
    Serial.println("[WARN] MIC init failed, VU may stay zero");
  }

  startSdProbeTask();
  Serial.println("[SD] async probe task started");
  requestSdProbe();

  updateTouch();
  updateImu();
  updateButtons();
  handleImuTapEvent();
  updateMicPeak();
  updateBattery();

  // Keep the base UI already drawn above; do not redraw it while the first SD
  // background probe might be using the bus.
  updateUiFast();
  updateUiSlow();
  updateVuMeter();
  updateMicText();
  updateFooter();
  printSerialStatus();

  Serial.println("[BOOT] ESP32-S3 1.47 Dashboard v7.14 D16-live-sense ready");
}

void loop() {
  uint32_t now = millis();

  // Update raw states as often as possible.
  updateMicPeak();
  updateButtons();
  handleImuTapEvent();

  // Full SD.begin() probe runs in a background task.
  // Main loop only consumes results and requests the next probe, so the UI stays smooth.
  consumeSdProbeResult();
  if (now - g_lastSdMs >= SD_REFRESH_MS) {
    g_lastSdMs = now;
    requestSdProbe();
  }

  if (now - g_lastBatMs >= BAT_REFRESH_MS) {
    g_lastBatMs = now;
    updateBattery();
  }

  if (now - g_lastSlowUiMs >= UI_TEXT_SLOW_MS) {
    g_lastSlowUiMs = now;
    updateImu();
    updateTouch();
    updateButtons();
    updateUiSlow();
  }

  if (now - g_lastFastUiMs >= UI_TEXT_FAST_MS) {
    g_lastFastUiMs = now;
    updateUiFast();
  }

  if (now - g_lastVuMs >= UI_VU_MS) {
    g_lastVuMs = now;
    updateVuMeter();
  }

  if (now - g_lastMicTextMs >= UI_MIC_TEXT_MS) {
    g_lastMicTextMs = now;
    updateMicText();
  }

  if (now - g_lastFooterMs >= FOOTER_MS) {
    g_lastFooterMs = now;
    updateFooter();
  }

  if (now - g_lastSerialMs >= SERIAL_MS) {
    g_lastSerialMs = now;
    printSerialStatus();
  }

  delay(1);
}
